# ImportIFCCategoryTable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ImportIFCCategoryTable Property
Application Class See Also
---
Full path to the file that defines IFC entity to Revit category mappings for IFC import.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string ImportIFCCategoryTable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ImportIFCCategoryTable As String
	Get
```

Visual C++
---
```text
public:
property String^ ImportIFCCategoryTable {
	String^ get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace